Documents/Комплектация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Комплектация</Name>
			<BasedOn>
				<xr:Item>Document.Спецификация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/Комплектация/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Спецификация") Тогда
		
		Подразделение = ДанныеЗаполнения.Подразделение;
		Спецификация = ДанныеЗаполнения;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Спецификация 			= ЭтотОбъект.Спецификация;
	КомплектацияСсылка 	= Документы.Комплектация.ПолучитьКомплектацию(Спецификация);
	
	Если ЗначениеЗаполнено(КомплектацияСсылка) И Ссылка <> КомплектацияСсылка Тогда
		
		Отказ 					= Истина;
		ТекстСообщения 	= "К " + Спецификация + " уже введена " + КомплектацияСсылка;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, КомплектацияСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Управленческий.Записать();
	
	Ошибки 						= Неопределено;
	СвойстваДокумента 	= ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, "Подразделение, Дата");
	Склад 						= ОбщегоНазначения.ПолучитьЗначениеРеквизита(СвойстваДокумента.Подразделение, "ОсновнойСклад");
	Нехватка 					= ЛексСервер.ПеремещениеМатериаловСЛогистики(Ссылка, Движения);
	
	Для каждого СтрокаНехватки Из Нехватка Цикл
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("На складе %1 недостаточно свободного материала %2. Из требуемых %3 есть только %4", 
		Склад,
		СтрокаНехватки.Номенклатура, 
		СтрокаНехватки.КоличествоТребуется,
		СтрокаНехватки.КоличествоОстаток);
		Поле = "СписокНоменклатуры[" +Строка(СтрокаНехватки.НомерСтроки-1) + "].Количество";
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, Поле, ТекстСообщения);
		
	КонецЦикла;
	
	Если Ошибки <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		Возврат;
		
	КонецЕсли;
	
	//Движения.Управленческий.Записать();
	//СвойстваДокумента 	= ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, "Подразделение, Дата");
	//ВидыСубконто 			= Новый Массив;
	//ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Склады);
	//ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	//
	//НехваткаМатериалов = Новый ТаблицаЗначений;
	//НехваткаМатериалов.Колонки.Добавить("Номенклатура");
	//НехваткаМатериалов.Колонки.Добавить("КоличествоТребуется");
	//НехваткаМатериалов.Колонки.Добавить("КоличествоОстаток");
	//НехваткаМатериалов.Колонки.Добавить("НомерСтроки");
	//
	//ИтогСуммаРеализации 	= 0;
	//Отказ 							= Ложь;
	//Запрос 							= Новый Запрос;
	//Запрос.Текст 					= 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	СписокНоменклатуры.НомерСтроки,
	//|	СписокНоменклатуры.Номенклатура,
	//|	СписокНоменклатуры.Количество,
	//|	СписокНоменклатуры.ЕдиницаИзмерения
	//|ПОМЕСТИТЬ СписокНоменклатуры
	//|ИЗ
	//|	Документ.Комплектация.СписокНоменклатуры КАК СписокНоменклатуры
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СписокНоменклатуры.Номенклатура,
	//|	СписокНоменклатуры.Количество,
	//|	ЕСТЬNULL(УправленческийОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	//|	ЕСТЬNULL(УправленческийОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	//|	СписокНоменклатуры.Количество * ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Внутренняя, 0) КАК СуммаРеализации
	//|ИЗ
	//|	СписокНоменклатуры КАК СписокНоменклатуры
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
	//|				&МоментВремени,
	//|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.МатериалыНаСкладе),
	//|				&ВидыСубконто,
	//|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.Логистика)
	//|					И Субконто2 В
	//|						(ВЫБРАТЬ
	//|							СписокНоменклатуры.Номенклатура
	//|						ИЗ
	//|							СписокНоменклатуры)) КАК УправленческийОстатки
	//|		ПО СписокНоменклатуры.Номенклатура = УправленческийОстатки.Субконто2
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	//|				&МоментВремени,
	//|				Регион = &Регион
	//|					И Номенклатура В
	//|						(ВЫБРАТЬ
	//|							СписокНоменклатуры.Номенклатура
	//|						ИЗ
	//|							СписокНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних
	//|		ПО СписокНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	//Запрос.УстановитьПараметр("МоментВремени", Ссылка.МоментВремени());
	//Запрос.УстановитьПараметр("Регион", Ссылка.Подразделение.Регион);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	Если Выборка.КоличествоОстаток < Выборка.Количество Тогда
	//		
	//		НоваяСтрока 									= НехваткаМатериалов.Добавить();
	//		НоваяСтрока.Номенклатура 				= Выборка.Номенклатура;
	//		НоваяСтрока.НомерСтроки 				= Выборка.НомерСтроки;
	//		НоваяСтрока.КоличествоТребуется 	= Выборка.Количество;
	//		НоваяСтрока.КоличествоОстаток 		= Выборка.КоличествоОстаток;
	//		
	//		Отказ = Истина;
	//		
	//		Продолжить;
	//		
	//	КонецЕсли;
	//	
	//	Себестоимость 									= Выборка.Количество / Выборка.КоличествоОстаток * Выборка.СуммаОстаток;
	//	Движение 											= Движения.Управленческий.Добавить();
	//	Движение.Период 								= СвойстваДокумента.Дата;
	//	Движение.Подразделение 					= Справочники.Подразделения.Логистика;
	//	Движение.СчетКт 								= ПланыСчетов.Управленческий.МатериалыНаСкладе;
	//	Движение.СубконтоКт.Склады 				= СвойстваДокумента.Подразделение.ОсновнойСклад;
	//	Движение.СубконтоКт.Номенклатура 	= Выборка.Номенклатура;
	//	Движение.КоличествоКт 						= Выборка.Количество;
	//	Движение.СчетДт 								= ПланыСчетов.Управленческий.РасходыЛогистики;
	//	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = Справочники.СтатьиДоходовРасходов.РасходыНаПроизводственныйМатериал;
	//	Движение.Сумма = Себестоимость;
	//	
	//	Движение 							= Движения.Управленческий.Добавить();
	//	Движение.Период 				= СвойстваДокумента.Дата;
	//	Движение.Подразделение 	= СвойстваДокумента.Подразделение;
	//	Движение.СчетКт 				= ПланыСчетов.Управленческий.ВзаиморасчетыСПодразделениями;
	//	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Подразделения] = Справочники.Подразделения.Логистика;
	//	
	//	Движение.СчетДт 								= ПланыСчетов.Управленческий.ОсновноеПроизводство;
	//	Движение.СубконтоДт.Номенклатура 	= ?(Выборка.Базовый, Выборка.Номенклатура, Выборка.БазоваяНоменклатура);
	//	Движение.КоличествоДт 						= Выборка.Количество * Выборка.КоэффициентБазовых;
	//	
	//	Движение.Сумма 								= Выборка.СуммаРеализации;
	//	ИтогСуммаРеализации 						= Выборка.СуммаРеализации + ИтогСуммаРеализации;
	//	
	//КонецЦикла;
	//
	//Движение 							= Движения.Управленческий.Добавить();
	//Движение.Период 				= СвойстваДокумента.Дата;
	//Движение.Подразделение 	= Справочники.Подразделения.Логистика;
	//Движение.СчетДт 				= ПланыСчетов.Управленческий.ВзаиморасчетыСПодразделениями;
	//Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Подразделения] = СвойстваДокумента.Подразделение;
	//
	//Движение.СчетКт = ПланыСчетов.Управленческий.Доходы;
	//Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = Справочники.СтатьиДоходовРасходов.ДоходыЛогистаОтПроизводства;
	//
	//Движение.Сумма = ИтогСуммаРеализации;
	
	
КонецПроцедуры
